import random
# порогове значення
thersold = .5
#print('порогове значення : ' + str(thersold))

#значення коефіцєнта ню
w1 = .05
w2 = .1
w3 = .3
#print('вагові коефіцієнти : ' + str(w1) + '  ' + str(w2) + '  ' + str(w3))

#Матриця всього
X =        [ [0, 0, 0, 0, 1, 1, 1, 1],   #поле початкової матриці
                [0, 0, 1, 1, 0, 0, 1, 1],   #поле початкової матриці
                [0, 1, 0, 1, 0, 1, 0, 1],   #поле початкової матриці
                [0, 0, 0, 0, 0, 0, 0, 0],   #поле істинності
                [0, 0, 0, 0, 0, 0, 0, 0]]   #поле суми добутків
#print('матриця на6ору вхідних даних : ' + str(X[:][:3]))

#перевірка порогового значення(виклик в функції розрахунку суми добутків)
def out_Y(a, b):
    if a > thersold:
        Y = 1
        X [4][b] = 1

def logic_operation(X):
    '''імплікація -->
       if елемент 1 множини = 1, а 2 = 0 то значення = 0
       У всіх інших випадках значення = 1'''
    с = 0 
    for loop in range(8):
        if  X [0][с] == 1 and X [1][с] == 0 :
            X [1][с] = 0
        else:
            X [1][с] = 1
        с += 1
#    print(X [1][:])
    '''диз'юнкція \/
      if хоч 1 елемент з двох множин = 1, то 1
      if обидва елементи = 0. то 0'''

    '''порівняння проводим з попередднім списком і останнім
      записуєм в 4 строку''' 
    n = 0
    for loop in range(8):
        if  X [1][n] == 0 and X [2][n] == 0 :
            X [3][n] = 0
        else:
            X [3][n] = 1
        n +=1
#    print('таблиця істинності : '+ str(X [3][:]))

#розрахунок суми добутків (а)
def sum_():
    a = 0
    b = 0
    for summ in range(8):
        a = X [0][b] * random.random() + X [1][b] * random.random() + X [2][b] * random.random()
        out_Y(a, b)
        b += 1
 #       print(a)

        
logic_operation(X)
sum_()
print(X [4][:])
